verification/runs/T-family/T15_runs/T15_UP_f/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | www.openfoam.com
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mergeType points;   // wedge: merge coincident axis points

scale 1;

vertices
(
    (0.000000000000 0.000000000000 0.000000000000)
    (0.000000000000 0.000000000000 8.000000000000)
    (0.099904822158 -0.004361938737 0.000000000000)
    (0.099904822158 -0.004361938737 8.000000000000)
    (0.099904822158 0.004361938737 0.000000000000)
    (0.099904822158 0.004361938737 8.000000000000)
    (0.399619288633 -0.017447754946 0.000000000000)
    (0.399619288633 -0.017447754946 8.000000000000)
    (0.399619288633 0.017447754946 0.000000000000)
    (0.399619288633 0.017447754946 8.000000000000)
    (1.198857865898 -0.052343264838 0.000000000000)
    (1.198857865898 -0.052343264838 8.000000000000)
    (1.198857865898 0.052343264838 0.000000000000)
    (1.198857865898 0.052343264838 8.000000000000)
    (2.397715731796 -0.104686529677 0.000000000000)
    (2.397715731796 -0.104686529677 8.000000000000)
    (2.397715731796 0.104686529677 0.000000000000)
    (2.397715731796 0.104686529677 8.000000000000)
);

blocks
(
    hex (0 4 5 1 0 2 3 1) (16 640 1) simpleGrading (1 1 1)
    hex (4 8 9 5 2 6 7 3) (48 640 1) simpleGrading (1 1 1)
    hex (8 12 13 9 6 10 11 7) (64 640 1) simpleGrading (1 1 1)
    hex (12 16 17 13 10 14 15 11) (32 640 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    source
    {
        type patch;
        faces
        (
            (0 2 4 0)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (2 6 8 4)
            (6 10 12 8)
            (10 14 16 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 3 5 1)
            (3 7 9 5)
            (7 11 13 9)
            (11 15 17 13)
        );
    }

    farfield
    {
        type patch;
        faces
        (
            (14 15 17 16)
        );
    }

    wedge_back
    {
        type wedge;
        faces
        (
            (0 2 3 1)
            (2 6 7 3)
            (6 10 11 7)
            (10 14 15 11)
        );
    }

    wedge_front
    {
        type wedge;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
            (8 12 13 9)
            (12 16 17 13)
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
