verification/runs/T-family/T15_runs/T15_UP_f/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | www.openfoam.com
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    source
    {
        type            fixedValue;
        value           uniform (0 0 0.600000);
    }
    floor
    {
        type            noSlip;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    farfield
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    wedge_back
    {
        type            wedge;
    }
    wedge_front
    {
        type            wedge;
    }
}

// ************************************************************************* //
