verification/runs/T-family/T15_runs/T15_UP_f/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | www.openfoam.com
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.000000;

boundaryField
{
    source
    {
        type            fixedValue;
        value           uniform 321.137600;
    }
    floor
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300.000000;
        value           uniform 300.000000;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 300.000000;
        value           uniform 300.000000;
    }
    wedge_back
    {
        type            wedge;
    }
    wedge_front
    {
        type            wedge;
    }
}

// ************************************************************************* //
