verification/runs/T-family/T15_runs/T15_UP_f/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | www.openfoam.com
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-06;

boundaryField
{
    source
    {
        type            fixedValue;
        value           uniform 0.00058217627;
    }
    floor
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }
    wedge_back
    {
        type            wedge;
    }
    wedge_front
    {
        type            wedge;
    }
}

// ************************************************************************* //
